### 전자서명 알고리즘

##### 이산대수를 이용 : Diffie-Hellman / EI gamal / DSA / KCDSA / Schnorr

##### 소인수분해를 이용 : RSA / Rabin

##### 기타 : ECC(타원곡선) / Knapsack 

---

#### Dos 공격의 대응 절차

##### 모니터링 -> 침임 탐지 -> 초동조치 -> 상세분석 -> 차단조치 

---

#### 유닉스 파일시스템 영역

##### boot 블록 : 파일시스템으로부터 리눅스 커널을 적재시키기 위한 프로그램

##### super 블록 : 파일시스템의 크기, 블록 수 등 이용 가능한 빈 블록 리스트와 빈 블록 리스트에서 그 다음 빈 블록을 가리키는 인덱스 정보가 있다. 이외에 inode 목록의 크기, 파일 시스템에 있는 빈 inode의 수와 목록, 빈 inode 목록에서 그 다음의 빈 inode의 수와 목록, 빈블록고 inode 목록들에 대한 lock 필드, 슈퍼 블록들이 수정되었는지 나타내는 flag, 파일 시스템 이름과 파일 시스템 디스크의 이름이 있다. 

##### inode 블록 : 파일이나 디렉터리에 대한 모든 정보를 가지고 있는 구조이다. 리눅스 커널이 현재 사용하는 자료구조를 유지하는 구조체로서 리눅스가 파일에 접근할 때는 inode 값으로 접근한다.                      inode 값은 일련의 숫자를 부여하여 파일을 관리한다. 리눅스에서 생성되는 모든파일에는 inode 값이 붙게되며 inode 값이 다르지만 하드 파일링크 경우 원본 파일과 링크파일 inode 값이 일치 

##### data 블룩 : 실제 데이터가 저장되어있는 파일

---

#### VPN 프로토콜 중 IPSEC에서 암호화 기능을 담당하는 프로토콜

##### ESP(Encapsulating Security Payload) : 새로운 데이터 IP Packet을 만들고 기존 IP Packet 을 Data Payload에 넣어 감싸는 방식 

---

#### 침입차단 시스템을 우회하기 위하여 침입차단시스템 내부망에 있는 시스템의 서비스 요청을 받는 것으로 가장하여 패킷을 전송한다. 

##### 상태검사 패킷 필터

##### 상태 추적 기능(Stateful Inspection) 

- ##### 패킷 필터링의 단점인 세션(Session)에 대한 추적 기능을 보완

- ##### 메모리상에 상태 추적 테이블을 만들어 단일 패킷이 아닌 뒤따르는 커넥션을 종합하여 평가한다. 

- ##### 이스라엘 보안업체 CheckPoint 사에서 최초 개발한 기능, 대부분 IDS에서 제공 

---

#### ICMP(Internet Control Message Protocol)

- ##### 인터넷 제어 메시지 프로토콜 오류 메세지를 전송받는데 주로 사용 

---

#### DoS 공격 유형

##### Land Attack : 출발지와 목저지가 같은 패킷을 생성하여 루프 상태에 빠지게함

##### Ping of Death Attack : ICMP 패킷을 아주 크게하여 전송, IP 단편화를 이용한 공격

##### Smurf Attack : 출발지를 공격 대상 IP로 위조한 ICMP 패킷을 브로드캐스트함. , 공격 타켓은 다수의 ICMP 응답을 받게됨.

##### TearDrop Attack : 하나의 IP 패킷이 분할된 IP단편의 offset 값을 서로 중첩되도록 조작하여 이를 재조합하는 공격 대상 시스템에 에러와 부하 유발 

---

#### 디지털 콘텐츠 저작권 보호 기술

##### DLP(Data Loss Prevention) : 데이터의 흐름을 감시하여 중요 데이터의 유출을 방지 

##### DRM(Data Rights Management) : 디지털 자료 혹은 하드웨어의 사용을 제한, 특정 자료를 저작권자의 의도로만 사용되게 끔한다. 

---

#### 라우팅 프로토콜 

##### 내부 라우팅 : IGP(Interior Gateway Protocol) : RIP, OSPF , IGRP

##### 외부 라우팅(Exterior Gateway Protocol) : EGP, BGP

##### AS(Autonomous System)자체 시스템 

---

#####  VPN에 사용되는 터널링은 인터넷 상에서 외부의 영향을 받지 않는 가상적인 경로를 형성해 정보를 주고 받도록 하는 기술

---

#### VPN 구성

##### 터널링 , 암호화및 인증 ,접근제어 

---

#### 위험관리 절차 

##### 위험 관리 계획수립 -> 위험 식별 -> 위험분석 수행 -> 위험 대응 계획수립 -> 위험 감시 및 통제 

---

#### 정보통신망법 목정 규정 

##### 제1조(목적) 정보통신망의 이용을 촉진하고 정보통신서비스를 이용하는 자를 보호함과 아울러 정보통신망을 건전하고 안전하게 이용할 수 있는 환경을 조성하여 국민생활의 향상과 공공복리의 증진에 이바지함을 목적으로한다.

---

#### 정보보호 관리 체계(ISMS) 과정순서

##### 정보보호 정책 수립 및 범위 설정 -> 경영진 책임 및 조직 구성 -> 위험 관리 -> 정보보호 대책 구현 -> 사후 관리 

---

#### OECD 정보보호 가이드 라인

#####  OECD Guidelines for the Security of Information Systems and Networks : Towards a Culture of Security (2002년) 

##### 9원칙 : 인식, 책임인식, 대응, 윤리, 민주성, 위험평가, 설계와 이행, 관리 , 재평가



##### ＊2015년에 다음으로 대체

##### Recommendation of the Council on Digital Security Risk Management For Economic and Social Prosperity(2015) 대체

##### 8원칙 : 인식 ㆍ기술ㆍ강화 , 책임, 인권과 기본가치, 협력 , 위험 평가와 관리 순환 , 보안조치, 혁신 ,준비와 연속성 

---

#### 위험 분석 

##### : Risk Analysis : 정보나 정보처리 기기에 대한 위협의 종류, 위협의 영향, 위협의 발생 가능성 등을 평가하는 과정 



##### 위험 분석 접근법 

- ##### 베이스라인 접근법(Baseline Approach) : 국내외 표준, 기준에 마련되어 있는 법령, 가이드 등으로 기준을 정하여 위험을 관리 

  - ##### 장점 : 시간 및 비용 절약 모든 조직에서 기본적으로 필요한 보호 대책 선택 가능 

  - ##### 단점 : 조직의 특성이 미반영되어 적정 보안 수준초과 또는 미달 가능성 

- ##### 비정형 접근법(Informal Approach) : 구조적인 방법론에 기반하지 않고 경험자의 지식을 사용하여 위험 분석을 수행 

  - ##### 장점 : 시간과 비용이 절약, 작은 조직에서 부담 없이 접근 가능 

  - ##### 단점 : 구조화된 방법이 아니며 보호대책 및 소요비용의 불확실성 존재 



- ##### 상세 위험 분석(Detailed Risk Analysis) : 정립된 모델에 기초하여 자산분석, 위험분석, 취약성 분석 각 단계를 수행하여 위험을 평가 

  - ##### 장점 : 조직 내 적절한 보안 수준 마련가능 

  - ##### 단점 : 전문적인 지식이 필요하고 시간과 비용을 많이 소모 



- ##### 복합 접근법 (Combined Approach) : 상세 위험 분석과 베이스 랑니 접근법을 복합적으로 사용

  - ##### 장점 : 비용과 자원을 효율적으로 사용 , 고위험 영역을 빠르게 식별 가능

  - ##### 단점 : 고위험 영역이 잘못 식별 경우, 위험 분석이 비용이 낭비되거나 부적절하게 대응 기능



#### 위험 분석 방법론 

- ##### 정량적 분석 방법 : 손실액과 같은 숫자값으로 표현

  - ##### 객관적인 평가기준이 적용 

  - ##### 비용과 이익에 대한 펴악가 필수적으로 요구

  - ##### 장점 : 정보의 가치가 논리적으로 평가되어 위험관리 성능 평가가 용이하다.

  - ##### 단점 : 계산이 복작하여 분석하는데 시간, 노력 많이 필요, 수치작업의 어려움이 신뢰도가 도구또는 벤더에 의존 

  - ##### 종류 및 지표 : 민감도 분석, 금전적 기대값 분석, 몬테카를로 시뮬레이션, 의사결정 나무 분석, 과거 자료 분석법 ,수학공식 접근법 , 확률분포법 등 

- ##### 정성적 분석방법 : 어떠한 위험 상황에 대한 부분을(매우높음 , 높음 , 중간 ,낮음) 등으로 표현

  - ##### 장점 : 정보자산에 대한 수치화가 불필요하여 계산에 대한 시간과 노력이 적게 든다. 

  - ##### 단점 : 위험 평가 과정과 측정기준이 일관되지 않고 주관적 , 위험 완화 대책 및 비용ㆍ효과가에 대한 명확한 근거가 없다, 위험관리 성능을 추적할 수 없다, 

  - ##### 종류 : 델파이법 : 전문가 집단의 의견과 판단을 추출, 짧은 시간에 도출, 정확도 낮음

    ##### 시나리오법 : 특정 시나리오를 통하여 발생가능한 위협의 결과를 우선순위로 도출 정확도 낮음

    ##### 순위결정법 : 비교우위 순위 결정표에 위험 항목들의 서술적 순위를 결정 정확도 낮음

---

